In [1]:
import pandas as pd
import pandas as pd
df = pd.read_csv(r"C:\\Users\\Natan\\OneDrive\\Documents\\Victor-projects\\projetos_python\\Data_analysis\\salaries-mls\\2010\\mls-salaries-2010.csv")
df

    club  last_name first_name position  base_salary  guaranteed_compensation
0     NY    Agudelo       Juan        F      40000.0                  70000.0
1     KC  Aiyegbusi  Olukorede        D      40000.0                  40000.0
2    COL      Akpan      Andre        F      40000.0                  65000.0
3     NY   Albright      Chris        D      84000.0                  84000.0
4    DAL  Alexander       Eric        M      40000.0                  40000.0
..   ...        ...        ...      ...          ...                      ...
406  CHV   Zemanski        Ben        M      40000.0                  40000.0
407  PHI  Zimmerman       Nick        D      40000.0                  40000.0
408  CHV      Zizzo        Sal        F      60000.0                  68250.0
409  CHV    Zotinca       Alex        D      60000.0                  60000.0
410   KC       Zusi     Graham      F-M      40000.0                  40000.0

[411 rows x 6 columns]

In [2]:
df['full_name'] = df['first_name'] + ' ' + df['last_name'] + ' ' + df['club']
df_agrupado = df.groupby('full_name', as_index=False)['base_salary'].max()
df_agrupado = df_agrupado.sort_values(by='base_salary', ascending=False)
df_agrupado

                full_name  base_salary
322     Rafael Marquez NY   5544000.00
115      David Beckham LA   5500000.08
379      Thierry Henry NY   5000000.04
245     Landon Donovan LA   2050000.00
221  Julian de Guzman TFC   1670796.00
..                    ...          ...
276   Michael Stephens LA     40000.00
27          Andy Najar DC     39000.00
394      Victor Ulloa DAL     31260.00
286  Moises Hernandez DAL     31260.00
94      Conor Shanosky DC     31250.04

[408 rows x 2 columns]

In [3]:
df_agrupado = df.groupby('position')['base_salary'].mean()
df_agrupado.sort_values(ascending=False)

position
F      223805.392184
M-F    205118.687500
M      166180.460656
D      132188.186441
M-D    103919.333333
GK      85948.636364
M/F     72000.000000
D-M     69611.111111
F-M     50000.013333
MF      40000.000000
Name: base_salary, dtype: float64

In [4]:
df_agrupado = df.groupby('club')['base_salary'].mean()
df_agrupado.sort_values(ascending=False)

club
NY      516791.108571
LA      384392.323200
CHI     201508.916667
TFC     191444.960000
NE      111830.603200
SEA     110389.482963
HOU     103847.827826
KC      103355.120000
CLB     103170.086957
PHI     103054.873043
DC       97728.424615
COL      97362.000000
SJ       94722.416667
RSL      93853.760000
DAL      86814.137931
CHV      85350.892857
Pool     40000.000000
Name: base_salary, dtype: float64

In [5]:
df['base_salary'].mean()

155982.83795620437

In [6]:
df_filtered = df[df['base_salary'] < 1500000]
df_filtered['base_salary'].mean()

105491.72908641976